In [3]:
import pandas as pd
a=pd.read_csv("Emp_data.csv")
a

       Name  Age   salary Gender
0      Hema   19   100000      M
1   Keerthi   18   200000      F
2   Neeraja   18   300000      M
3     Kittu   19   400000      F
4   Haseena   18   500000      M
5  Jyothsna   17   600000      F
6     Divya   16   700000      M
7  Likhitha   20   800000      F
8   Lakshmi   21   900000      M
9      Maha   33  1000000      F

In [4]:
a.groupby(["Name"])

In [15]:
b=a.groupby(["Name","Age"])
b.groups

{('Divya', 16): Int64Index([6], dtype='int64'),
 ('Haseena', 18): Int64Index([4], dtype='int64'),
 ('Hema', 19): Int64Index([0], dtype='int64'),
 ('Jyothsna', 17): Int64Index([5], dtype='int64'),
 ('Keerthi', 18): Int64Index([1], dtype='int64'),
 ('Kittu', 19): Int64Index([3], dtype='int64'),
 ('Lakshmi', 21): Int64Index([8], dtype='int64'),
 ('Likhitha', 20): Int64Index([7], dtype='int64'),
 ('Maha', 33): Int64Index([9], dtype='int64'),
 ('Neeraja', 18): Int64Index([2], dtype='int64')}

In [16]:
a.groupby(["Age"]).mean()

             salary
Age
16    700000.000000
17    600000.000000
18    333333.333333
19    250000.000000
20    800000.000000
21    900000.000000
33   1000000.000000

In [17]:
a.groupby(["Age"]).max()

         Name   salary Gender
Age
16      Divya   700000      M
17   Jyothsna   600000      F
18    Neeraja   500000      M
19      Kittu   400000      M
20   Likhitha   800000      F
21    Lakshmi   900000      M
33       Maha  1000000      F

In [18]:
a.groupby(["Age"]).min()

         Name   salary Gender
Age
16      Divya   700000      M
17   Jyothsna   600000      F
18    Haseena   200000      F
19       Hema   100000      F
20   Likhitha   800000      F
21    Lakshmi   900000      M
33       Maha  1000000      F

In [19]:
a.groupby(["Age"]).groups

{16: Int64Index([6], dtype='int64'),
 17: Int64Index([5], dtype='int64'),
 18: Int64Index([1, 2, 4], dtype='int64'),
 19: Int64Index([0, 3], dtype='int64'),
 20: Int64Index([7], dtype='int64'),
 21: Int64Index([8], dtype='int64'),
 33: Int64Index([9], dtype='int64')}

In [20]:
c=a.groupby(["Gender"])
c.get_group("F")

       Name  Age   salary Gender
1   Keerthi   18   200000      F
3     Kittu   19   400000      F
5  Jyothsna   17   600000      F
7  Likhitha   20   800000      F
9      Maha   33  1000000      F

In [23]:
a["Gender"].value_counts()

F    5
M    5
Name: Gender, dtype: int64

In [9]:
import pandas as pd
p1=pd.array([1,3,2,4,6])
p1

<PandasArray>
[1, 3, 2, 4, 6]
Length: 5, dtype: int32

In [11]:
p1.mean()

3.2